app/controllers/posts_controller.rb

  def create
    @posts = current_user.posts.create!(post_params)
---
INSERT INTO "posts" ("title", "text", "commentCounter", "likeCounter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Learn Elm"], ["text", "Learn Elm"], ["commentCounter", nil], ["likeCounter", nil], ["created_at", "2022-03-10 17:43:39.868040"], ["updated_at", "2022-03-10 17:43:39.868040"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Shopping"], ["updated_at", "2022-03-10 17:43:40.433312"], ["id", 103]]