app/controllers/posts_controller.rb

  def postbyauser
    @post_by_user = Post.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]